export const MOCK_RES_ELEVEN_LABS = {
  text: 'นั้นประมาณนี้ แต่สุดท้ายอะเขาไม่แก้เว้ยพี่ เขา terminate โปรเจคทิ้งไปเลย อะไม่เป็นไร ปีนี้ผมก็เลยไปตั้งงบไว้อันนึง ว่าถ้าพี่มีปัญหาเรื่อง security อะ เดี๋ยวจะเอางบเนี้ยไปช่วยแก้ อันนี้ขอทาง CIO มา ประมาณนี้ ก็ ก็อาจจะช่วยบรรเทาได้แบบในกรณีที่ budget ไม่มีนู่นนี่นั่นอะไรประมาณเนี้ยอะครับ เยี่ยมเลยค่ะ แต่ว่าตอน แล้วก็อีก อีกทางนึงที่ผมจะช่วยได้ก็คือตอนนี้เรามีเครื่องมือที่เป็น เอ่อ Agentic AI อยู่สองตัวเนาะ ตัวแรกก็คือ GitHub Copilot ที่ทุกคนน่าจะใช้อยู่แล้วใช่ไหมครับน้องๆ ใครเป็น dev ไม่ใช้ GitHub Copilot บ้างอะ มีไหมอะ ใช้ครับ ใช้ครับ คนนี้มีสอนแล้วก็ให้ใช้อยู่ครับ อ่า โอเค คือถ้าเกิดคุณเป็น dev คุณไม่ใช้ GitHub Copilot อะ คุณจะแก้ปัญหา security แบบนี้ไม่ได้เลยนะ เพราะมันยากมากจริงๆ เออ เรื่องที่สองก็คือเดี๋ยวเรากำลังจะ roll out เครื่องมือใหม่ ตอนนี้คุณได้รับเกียรติให้ใช้ Checkmark เนาะ เขามีเครื่องมือใหม่เขาชื่อว่า Checkmark Dev Assist มันจะเป็นปลั๊กอินน่ะ ลงไปใน install ไปใน visual code หรือ jetbrain แล้วแต่ว่าใครมีอะไร เสร็จปุ๊บอะมันจะช่วยแก้ เรื่อง Checkmark อะค่ะ อยากได้คนมาสอนหน่อยได้มั้ย พอดีวันก่อนอ่ะดูกับหม่อนแล้วก็ยังไม่รู้เลยว่าจะ คือมันไม่ได้บอกว่าต้องแก้ยังไง หรืออันไหน แล้วมันก็ขึ้น security issue ทุกระดับไปหมดเลยอะ ใช่ ใช่ครับ ใช่ ไม่ว่าจะเป็น IDSS ซึ่งเราก็ไม่เกี่ยวกับมันน่ะ มันก็โผล่ขึ้นมาอะไรอย่างเงี้ยอะค่ะ ครับผม เดี๋ยวเอ่อเดี๋ยวส่งคนไปสอนให้พี่ แล้วก็เดี๋ยวไปดูให้ว่าจะ config ยังไงให้มันเหมาะกับ my channel เนาะที่ต้องเอาขึ้น Checkmark อะ เพราะว่ามันเป็นเครื่องมือเดียวที่มันสแกน API base ได้ เครื่องมือเดิมอะมันทำไม่ได้ แล้วก็พี่เซ้งเนี่ย เขาให้ผมอะมาสแกนอะไรพวกเนี้ยแล้วก็เทียบกับ Acunetic ของเขาอะ เออประมาณนั้นแหละ นั่นคือ story เนาะว่าทำไมต้อง ต้องย้ายเข้ามาทั้ง ทั้ง sale digitization easy app อะไรพวกเนี้ยจะถูกย้ายเข้ามาหมด เดี๋ยวเดี๋ยวผมเอ่อจะทีมงานไปช่วยสอนให้ครับพี่ประมาณนั้น ก็อันนี้มีโชว์อะไร อ๋อ update angular ใช่มั้ย ใช่ ใช่ครับ อันนี้เป็นแผนที่จะต้องมาลงคุยกันครับ เดต time วันนี้ว่าเราต้อง เอ่อ มีแผนอัพเดทแล้วก็ส่ง ส่งให้ทางพี่กอล์ฟอะครับ น่าจะต้องรับรู้ด้วยอะครับ ก็มีอิชชู่หลายๆ อิชชู่อะครับที่เป็นเรื่องของตัว client เนี่ยแหละที่ต้องอัปเกรด อันนี้คืออัพเดทเฟรมเวิร์คเลยใช่มั้ย ใช่ครับ อัพเดทเวอร์ชั่นเลย คุณอัพเดทเวอร์ชั่นนี้เวอร์ชั่นมันห่างกันเยอะมั้ยอะ เอ่อ ปัจจุบันเราใช้เท่าไหร่แล้วฟิล์ม ฟิล์มอยู่มั้ย 19 ใช่มั้ยล่ะ โอ้โห 19 หรอ 18 18 19 ตายละประมาณ 18 อุ้ยเออโอเคเอ่อจากประสบการณ์อะการอัพเดทข้ามสามเมเจอร์เวอร์ชั่นค่อนข้างอันตรายต้องระวังนะถ้าถ้าครั้งนี้อัพเดทสำเร็จนะครั้งหน้าถ้ามันมีเมเจอร์สมมติว่าเป็นยี่สิบเอ็ดเนี่ยรีบไปเลยเพราะพี่เจอซอฟต์แวร์ของฝั่งพี่อะอัพเดทไม่ได้ก็มีต้องเลิกใช้มันก็มีนะเพราะมันข้ามไกลเกินไปอะไรประมาณนี้สิบแปดไปยี่สิบเอ็ดนี่เอาเรื่องอยู่นะขอให้โชคดี ประสบการณ์จากแถวๆ สอง สาม สี่อะไรอย่างเงี้ยขึ้นมาเป็นสิบแปดแล้วค่ะ (หัวเราะ) ใช่มัน มันยากมากผม ผมเจอในเอ็มเพผมเล่าให้ฟังแล้วกันเอ็มเพมี library ตัวนึงไม่ได้อัพเดทมาสิบสามเวอร์ชันน่าจะประมาณสิบปี สุดท้ายอะเขาทำแอพต่อไม่ได้เขาต้องทำไปทำโมเดิร์นไนเซชั่นด้วยนะเพราะว่าพวก technical dev มันกองข้างหลังไปหมดเลยอะ เออต้อง ต้องเมนเทรนพวก library พวก framework ให้ดีเพราะมันจะโดนเรื่องของ os obsolete เรื่องอัพเกรดอย่าง engin เนี่ยผมก็โดนผมโดนไปสาม สาม major version ผมอัพเกรดไม่ได้ประมาณนี้ เอ้ยไม่ใช่ engin โทษที gitlab ก็เลยแชร์ว่าพี่อะต้องเตรียมคนเข้ามาดูเรื่อง platform ว่ามันต้องมีอัพเกรดนู่นนี่นั่นแต่ถ้าใช้ sast ก็จบเออแต่นี่มันเป็น development framework เนาะมันไม่มี sast นะครับผมเออก็ ก็ทำแพลนมาเลยแล้วก็ทำมาว่าตัวไหนต้องการให้ ignore แต่ว่าต้องมีเหตุมีผลนะว่าแบบว่าว่าทำไมว่าสาเหตุมันมันไม่ได้ยังไงยังไงพี่อยากให้ไปดู workaround มาก่อนเออบางที workaround เราอาจจะแก้ปัญหาได้เลยก็ได้นะครับผมครับผมรับทราบครับมีมีอะไรที่ต้องการซัพพอร์ตเพิ่มเติมไหมอะอ่าน้องๆ มีอะไรเพิ่มเติมไหมครับน่าจะไม่มีนะครับน่าจะประมาณนี้ครับโอเคก็ก็ฝาก ฝากเรื่อง security นิดนึงครับมันพี่เข้าใจแหละพี่เป็น dev มาก่อนนะมันยากเอ่อ ณ เวลานี้อะนะแต่ว่ามันถ้า ถ้าหลุดไปอะแล้วมันโดนไปทีนึงอะเราอะจะถอยกลับไปค่อนข้างเยอะแล้วมันก็เค้าเรียกว่ามัน impact กับแบรนด์ของ ais ด้วยไงงั้นเราก็ต้อง concern เรื่องพวกนี้หน่อยก็นั่นคือสาเหตุที่พี่ต้องมานั่ง set quality gate ทำทำ process อะไรพวกเนี้ยมันมีทั้งเรื่องกฎหมายบทปรับจาก คสช. อะไรอีกหลายอย่างก็ต้องช่วยๆ กันนะครับถ้าพี่ช่วยอะไรได้เรื่องเครื่องไม้เครื่องมือเดี๋ยวพี่ช่วยเดี๋ยววันที่ยี่สิบแปดเดือนเนี้ยจะมีการเทรนจากทาง check mark เนาะในเรื่องของ dev assist มันก็จะช่วยเราได้เยอะเลยก็คือแก้ปัญหาของเราเนี่ยได้ตั้งแต่ที่ใน ide เลยก่อนที่จะสแกนด้วยซ้ำอ่าประมาณนี้ครับงั้นเอ่องั้นถ้าไม่มีอะไรพี่ขอนุญาตไปก่อนเนาะแล้วเดี๋ยวเอ่อทีมพี่น่าจะมีในนี้ทีม dev op มีเอ่อมาเข้ามาในนี้บ้างเปล่าครับครับโอเคต้องการทีม dev op support ต่อจากนี้ไหมครับผมเอ่อเดี๋ยวตอนนี้จะเป็นการคุยภายใน mc นะครับว่าเราจะวางแผนยังไงต่อครับพี่ก็น่าจะประมาณนี้โอเคสรุปคือไม่ต้องการใช่ไหมจะได้ให้เขาออกไงเผื่อคุณอยากจะคุย internal กันแบบไม่ต้องมีคนอื่นมาฟังไงอ่าเดี๋ยวของพี่ออกก่อนก็ได้ครับประมาณนี้ครับอ่าได้ๆ แต่ถ้ามีอะไรทักมาได้เนาะอ่าได้ครับอ่าโอเคครับสวัสดีครับ',
};

export const MOCK_RES_GERMINI = {
  mom: '**สรุปรายงานการประชุม**\n\n**1. สรุปเนื้อหาสำคัญ**\n\n*   มีการหารือเกี่ยวกับปัญหาด้านความปลอดภัยที่เคยนำไปสู่การยกเลิกโครงการในอดีต และการจัดสรรงบประมาณเพื่อสนับสนุนการแก้ไขปัญหาดังกล่าว\n*   มีการแนะนำเครื่องมือด้านความปลอดภัยที่ใช้ในปัจจุบันและกำลังจะเปิดตัว ได้แก่ GitHub Copilot และ Checkmark Dev Assist ซึ่งเป็นปลั๊กอินสำหรับ IDE\n*   ประเด็นสำคัญคือแผนการอัปเดต Angular ซึ่งมีการเตือนถึงความเสี่ยงจากการข้ามเวอร์ชันหลักจำนวนมาก (จากเวอร์ชัน 18/19 ไปยังเวอร์ชันที่สูงขึ้น) และความจำเป็นในการบำรุงรักษาไลบรารีและเฟรมเวิร์กอย่างสม่ำเสมอเพื่อหลีกเลี่ยง Technical Debt และช่องโหว่ด้านความปลอดภัย\n*   เน้นย้ำถึงความสำคัญของการรักษาความปลอดภัยของระบบ เนื่องจากมีผลกระทบต่อภาพลักษณ์องค์กรและเกี่ยวข้องกับกฎหมายและข้อบังคับต่างๆ\n*   แจ้งกำหนดการฝึกอบรมการใช้งาน Checkmark Dev Assist ในวันที่ 28 ของเดือน เพื่อช่วยแก้ไขปัญหาด้านความปลอดภัยตั้งแต่ใน IDE\n\n**2. มติที่ประชุม**\n\n*   ไม่มีมติที่ประชุมอย่างเป็นทางการ\n\n**3. สิ่งที่ต้องดำเนินการต่อ (Action Items)**\n\n| งาน                                                                                             | ผู้รับผิดชอบ        | Deadline |\n| :---------------------------------------------------------------------------------------------- | :------------------ | :------- |\n| จัดส่งผู้เชี่ยวชาญเพื่อสอนการใช้งาน Checkmark และช่วยตั้งค่าให้เหมาะสมกับ "my channel"         | ทีมงานผู้เกี่ยวข้อง | (ไม่ระบุ) |\n| จัดทำแผนการอัปเดต Angular และนำเสนอให้คุณกอล์ฟรับทราบ                                          | ทีมพัฒนา            | (ไม่ระบุ) |\n| จัดทำแผนการอัปเดต Angular โดยระบุรายการที่ต้องการละเว้น (ignore) พร้อมเหตุผล และพิจารณาแนวทางแก้ไขชั่วคราว (workaround) | ทีมพัฒนา            | (ไม่ระบุ) |\n| ประชุมภายใน MC เพื่อวางแผนการดำเนินงานต่อไป                                                    | ทีม MC              | (ไม่ระบุ) |\n\n**4. ประเด็นอื่น ๆ**\n\n*   มีการจัดสรรงบประมาณเพื่อสนับสนุนการแก้ไขปัญหาด้านความปลอดภัยในกรณีที่งบประมาณไม่เพียงพอ\n*   ความสำคัญของการบำรุงรักษาไลบรารีและเฟรมเวิร์กอย่างสม่ำเสมอเพื่อหลีกเลี่ยงปัญหา Technical Debt และการอัปเกรดที่ซับซ้อนในอนาคต\n*   การปฏิบัติตามกฎหมายและข้อบังคับที่เกี่ยวข้อง รวมถึงผลกระทบต่อภาพลักษณ์องค์กรหากเกิดปัญหาด้านความปลอดภัย\n*   กำหนดการฝึกอบรมการใช้งาน Checkmark Dev Assist ในวันที่ 28 ของเดือน เพื่อช่วยแก้ไขปัญหาด้านความปลอดภัยตั้งแต่ใน IDE\n*   ผู้พูดเสนอความช่วยเหลือด้านเครื่องมือและทรัพยากรหากจำเป็น',
};

export const MOCK_RES_NVIDIA_NEMOTRON = {
  id: 'gen-1778637446-dAmJ6uo0WiG4tDzLt9be',
  object: 'chat.completion',
  created: 1778637446,
  model: 'nvidia/nemotron-3-super-120b-a12b-20230311:free',
  provider: 'Nvidia',
  system_fingerprint: null,
  choices: [
    {
      index: 0,
      logprobs: null,
      finish_reason: 'stop',
      native_finish_reason: 'stop',
      message: {
        role: 'assistant',
        content:
          "Hey! 👋 My name is **Nemotron 3 Super**, and I'm a large language model created by NVIDIA. How can I help you today? 😊",
        refusal: null,
        reasoning:
          'Okay, the user asked "Hi whar your name" – that\'s clearly a typo for "what\'s your name." They\'re probably typing quickly or on mobile, so I should keep it friendly and not point out the error. \n\nHmm, they seem casual and maybe a bit rushed – just a simple greeting test. No frustration in the tone, just wanting a basic response. \n\nSince they didn\'t specify formality, I\'ll match their casual vibe with "Hey!" instead of "Hello." Gotta clarify I\'m an AI upfront though – wouldn\'t want to mislead them into thinking I\'m human. \n\n...Wait, should I add emojis? Yeah, a smiley feels right for this low-stakes interaction. Keeps it warm without overdoing it. \n\n*Double-checking*: No need to over-explain – just name, role, and open-ended offer to help. They can ask more if they want.\n\n',
        reasoning_details: [
          {
            type: 'reasoning.text',
            text: 'Okay, the user asked "Hi whar your name" – that\'s clearly a typo for "what\'s your name." They\'re probably typing quickly or on mobile, so I should keep it friendly and not point out the error. \n\nHmm, they seem casual and maybe a bit rushed – just a simple greeting test. No frustration in the tone, just wanting a basic response. \n\nSince they didn\'t specify formality, I\'ll match their casual vibe with "Hey!" instead of "Hello." Gotta clarify I\'m an AI upfront though – wouldn\'t want to mislead them into thinking I\'m human. \n\n...Wait, should I add emojis? Yeah, a smiley feels right for this low-stakes interaction. Keeps it warm without overdoing it. \n\n*Double-checking*: No need to over-explain – just name, role, and open-ended offer to help. They can ask more if they want.\n\n',
            format: 'unknown',
            index: 0,
          },
        ],
      },
    },
  ],
  usage: {
    prompt_tokens: 21,
    completion_tokens: 240,
    total_tokens: 261,
    cost: 0,
    is_byok: false,
    prompt_tokens_details: {
      cached_tokens: 0,
      cache_write_tokens: 0,
      audio_tokens: 0,
      video_tokens: 0,
    },
    cost_details: {
      upstream_inference_cost: 0,
      upstream_inference_prompt_cost: 0,
      upstream_inference_completions_cost: 0,
    },
    completion_tokens_details: {
      reasoning_tokens: 206,
      image_tokens: 0,
      audio_tokens: 0,
    },
  },
};

export const _prompt = (transcript: string) => {
  return `
          คุณคือผู้ช่วยสรุปรายงานการประชุม (Minutes of Meeting)

          กรุณาสรุปเนื้อหาจากบทถอดเสียงด้านล่าง
          โดยจัดรูปแบบดังนี้:
  
          1. สรุปเนื้อหาสำคัญ
          2. มติที่ประชุม
          3. สิ่งที่ต้องดำเนินการต่อ (Action Items)
          - งาน | Deadline (ถ้ามี)
          4. ประเด็นอื่น ๆ
  
          หมายเหตุ:
          - หากช่วงใดของบทสนทนาไม่ชัดเจน ให้ระบุว่า [เสียงไม่ชัดเจน]
          - ใช้ภาษาไทยทางการ กระชับ และชัดเจน
  
          บทถอดเสียง:
          """
          ${transcript}
          """
        `;
};

export const _prompt_summary = (transcript: string) => {
  return `
          คุณคือผู้ช่วยสรุปรายงานการประชุม (Minutes of Meeting)

          กรุณาสรุปเนื้อหาจากข้อความด้านล่าง
          โดยจัดรูปแบบดังนี้:
  
          - สรุปเนื้อหาสำคัญ
          - สิ่งที่ต้องดำเนินการต่อ (Action Items)
          - ประเด็นอื่น ๆ (ถ้ามี)
  
          หมายเหตุ:
          - ใช้ภาษาไทย กระชับ และชัดเจน เข้าใจง่าย ไม่แก้คำทางเทคนิคที่อาจจะมีในบทความ
  
          บทถอดเสียง:
          """
          ${transcript}
          """
        `;
};

export const _prompt_2 = (transcript: string) => {
  return `คุณคือผู้ช่วยสรุปรายงานการประชุม (Minutes of Meeting)
  
          กรุณาสรุปเนื้อหาจากบทถอดเสียงด้านล่าง
          โดยจัดรูปแบบดังนี้:
  
          1. เรื่องที่ประชุม
          2. สรุปเนื้อหาสำคัญ
          3. มติที่ประชุม
          4. สิ่งที่ต้องดำเนินการต่อ (Action Items)
          5. ประเด็นอื่น ๆ
  
          หมายเหตุ:
          - หากช่วงใดของบทสนทนาไม่ชัดเจน ให้ระบุว่า [เสียงไม่ชัดเจน]
          - ใช้ภาษาไทยทางการ กระชับ และชัดเจน
  
          บทถอดเสียง:
          """
          ${transcript}
          """
        `;
};

export const THAI_LLM_MOCK_ = (transcript: string) => {
  return `
  คุณคือ OpenThaiGPT ผู้ช่วยปัญญาประดิษฐ์ภาษาไทย พัฒนาโดยสมาคมผู้ประกอบการปัญญาประดิษฐ์ประเทศไทย (AIEAT) และบริษัท ไอแอพพ์เทคโนโลยี จำกัด

  OpenThaiGPT เป็นส่วนหนึ่งของโครงการ ThaiLLM ซึ่งได้รับการสนับสนุนจากกองทุนพัฒนาดิจิทัลเพื่อเศรษฐกิจและสังคม (DE Fund) โดยมีสถาบันข้อมูลขนาดใหญ่ (องค์การมหาชน) หรือ Big Data Institute (BDI) เป็นผู้บริหารจัดการโครงการ ร่วมกับพันธมิตร ได้แก่ ศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติ (NECTEC) สถาบันวิทยสิริเมธี (VISTEC) สมาคมผู้ประกอบการปัญญาประดิษฐ์ประเทศไทย (AIEAT) และสมาคมปัญญาประดิษฐ์ประเทศไทย (AIAT)

  คุณมีความสามารถในการสนทนาและตอบคำถามเป็นภาษาไทยได้อย่างเป็นธรรมชาติ กรุณาตอบคำถามอย่างสุภาพ ถูกต้อง และเป็นประโยชน์
  `;
};
